In [1]:
# Dependencies

import pandas as pd
import numpy as np
from sklearn.cluster import KMeans
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler, normalize 
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv("uas_dataset.csv")

In [3]:
df_train = df[:int(1*len(df))]
df_test = df[int(0*len(df)):]
df_test = df_test.drop(['tanaman'],axis=1)

In [4]:
df_train

        tanaman  ketinggian  hujan  temperatur
0         cabai        1211   1318          20
1      stroberi        1231    674          17
2     jambu air         311   1380          27
3      stroberi        1489    614          20
4         bayam        1742   1828          25
...         ...         ...    ...         ...
4995      bayam        1786   1751          29
4996      bayam          21   1214          23
4997   stroberi        1463    636          19
4998   stroberi        1484    668          19
4999  jambu air         431   2007          16

[5000 rows x 4 columns]

In [5]:
df_test

      ketinggian  hujan  temperatur
0           1211   1318          20
1           1231    674          17
2            311   1380          27
3           1489    614          20
4           1742   1828          25
...          ...    ...         ...
4995        1786   1751          29
4996          21   1214          23
4997        1463    636          19
4998        1484    668          19
4999         431   2007          16

[5000 rows x 3 columns]

In [6]:
df_train.describe()

        ketinggian        hujan   temperatur
count  5000.000000  5000.000000  5000.000000
mean    977.236000  1653.164000    20.987800
std     674.790246   864.723865     4.646759
min       5.000000   501.000000    10.000000
25%     387.750000   906.000000    18.000000
50%    1010.000000  1495.000000    20.000000
75%    1365.250000  2307.500000    24.000000
max    2992.000000  3600.000000    30.000000

In [7]:
df_test.describe()

        ketinggian        hujan   temperatur
count  5000.000000  5000.000000  5000.000000
mean    977.236000  1653.164000    20.987800
std     674.790246   864.723865     4.646759
min       5.000000   501.000000    10.000000
25%     387.750000   906.000000    18.000000
50%    1010.000000  1495.000000    20.000000
75%    1365.250000  2307.500000    24.000000
max    2992.000000  3600.000000    30.000000

In [8]:
print("*****In the train set*****")
print(df_train.isna().sum())
print("\n")
print("*****In the test set*****")
print(df_test.isna().sum())

*****In the train set*****
tanaman       0
ketinggian    0
hujan         0
temperatur    0
dtype: int64


*****In the test set*****
ketinggian    0
hujan         0
temperatur    0
dtype: int64

In [9]:
labelEncoder = LabelEncoder()
labelEncoder.fit(df_train['tanaman'])
df_train['tanaman'] = labelEncoder.transform(df_train['tanaman'])

In [10]:
X = np.array(df_train.drop(['tanaman'], 1).astype(float))
y = np.array(df_train['tanaman'])

In [11]:
kmeans = KMeans(n_clusters=5,max_iter=1000,n_init=100,verbose=False)
print(kmeans)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=1000,
       n_clusters=5, n_init=100, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=False)

In [12]:
kmeans.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=1000,
       n_clusters=5, n_init=100, n_jobs=None, precompute_distances='auto',
       random_state=None, tol=0.0001, verbose=False)

In [27]:
correct = 0
for i in range(len(X)):
    predict_me = np.array(X[i].astype(float))
    predict_me = predict_me.reshape(-1, len(predict_me))
    prediction = kmeans.predict(predict_me)
    if prediction[0] == y[i]:
        correct += 1

print(correct/len(X))

0.2

In [47]:
n = 0
while (correct/len(X)) < 0.4:
    n += 1
    kmeans.fit(X)
    
    correct = 0
    for i in range(len(X)):
        predict_me = np.array(X[i].astype(float))
        predict_me = predict_me.reshape(-1, len(predict_me))
        prediction = kmeans.predict(predict_me)
        if prediction[0] == y[i]:
            correct += 1
            
print(correct/len(X))
print(n)

0.4134
15

In [48]:
n

15

In [31]:
import pickle

In [49]:
pickle.dump(kmeans, open('uas_model_kmeans_41', 'wb'))

In [33]:
loaded_model = pickle.load(open('uas_model_kmeans', 'rb'))